## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azuread_application_registration.rcm_adb_app will be destroyed
  # (because azuread_application_registration.rcm_adb_app is not in configuration)
  - resource "azuread_application_registration" "rcm_adb_app" {
      - client_id                              = "b08d11ed-56a1-4ab7-9f47-cc4211e4c426" -> null
      - disabled_by_microsoft                  = "map[false:]" -> null
      - display_name                           = "vj-rcm-dev-adb-app" -> null
      - group_membership_claims                = [] -> null
      - id                                     = "/applications/eeb28d1a-c094-42c2-ba05-0310bac401a9" -> null
      - implicit_access_token_issuance_enabled = false -> null
      - implicit_id_token_issuance_enabled     = false -> null
      - object_id                              = "eeb28d1a-c094-42c2-ba05-0310bac401a9" -> null
      - publisher_domain                       = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - requested_access_token_version         = 2 -> null
      - sign_in_audience                       = "AzureADMyOrg" -> null
        # (9 unchanged attributes hidden)
    }

  # azuread_service_principal.rcm_adb_sp will be destroyed
  # (because azuread_service_principal.rcm_adb_sp is not in configuration)
  - resource "azuread_service_principal" "rcm_adb_sp" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
      - client_id                     = "b08d11ed-56a1-4ab7-9f47-cc4211e4c426" -> null
      - display_name                  = "vj-rcm-dev-adb-app" -> null
      - id                            = "/servicePrincipals/1db39d05-39c6-4594-ae1e-05b13e5c4c9f" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "1db39d05-39c6-4594-ae1e-05b13e5c4c9f" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azuread_service_principal_password.rcm_adb_pass will be destroyed
  # (because azuread_service_principal_password.rcm_adb_pass is not in configuration)
  - resource "azuread_service_principal_password" "rcm_adb_pass" {
      - end_date             = "2027-01-24T12:33:17.9244945Z" -> null
      - id                   = "1db39d05-39c6-4594-ae1e-05b13e5c4c9f/password/16f55f7c-1d74-485d-8bcf-0552a3d7bb9f" -> null
      - key_id               = "16f55f7c-1d74-485d-8bcf-0552a3d7bb9f" -> null
      - rotate_when_changed  = {
          - "rotation" = "2025-01-24T11:40:49Z"
        } -> null
      - service_principal_id = "/servicePrincipals/1db39d05-39c6-4594-ae1e-05b13e5c4c9f" -> null
      - start_date           = "2025-01-24T12:33:17.9244945Z" -> null
      - value                = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
        id                    = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf/linkedservices/vj-rcm-dev-adls-ls"
        name                  = "vj-rcm-dev-adls-ls"
      ~ storage_account_key   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "d4efe806-c98b-46f5-bb54-6a7d1276b11a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "6db93c42-e026-4dcc-bf15-01824ab47004"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # time_rotating.month will be destroyed
  # (because time_rotating.month is not in configuration)
  - resource "time_rotating" "month" {
      - day              = 10 -> null
      - hour             = 11 -> null
      - id               = "2025-01-24T11:40:49Z" -> null
      - minute           = 40 -> null
      - month            = 3 -> null
      - rfc3339          = "2025-01-24T11:40:49Z" -> null
      - rotation_days    = 45 -> null
      - rotation_rfc3339 = "2025-03-10T11:40:49Z" -> null
      - second           = 49 -> null
      - unix             = 1741606849 -> null
      - year             = 2025 -> null
    }

Plan: 1 to add, 2 to change, 4 to destroy.
```
</details>